<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
   <TITLE>Navig&aacute;l&aacute;si eszk&ouml;z&ouml;k</TITLE>
   <META NAME="Author" CONTENT="">
   <META NAME="GENERATOR" CONTENT="Mozilla/3.04Gold (Win95; I) [Netscape]">
</HEAD>
<BODY TEXT="#000000" BGCOLOR="#FFFFE8" LINK="#0000EE" VLINK="#551A8B" ALINK="#FF0000">

<H2 ALIGN=CENTER>Grafikai tervez&eacute;s</H2>

<H3><I>Navig&aacute;l&aacute;si eszk&ouml;z&ouml;k</I></H3>

<P><B>&Aacute;lland&oacute; ikonsor.</B> Az oldal f&otilde;bb r&eacute;szei
k&ouml;z&ouml;tti navig&aacute;l&aacute;st seg&iacute;theted azzal, hogy
minden oldal tetej&eacute;re vagy alj&aacute;ra elhelyezed ezeknek a r&eacute;szeknek
az ikonjait.&nbsp;Ez a sor valahogy &iacute;gy n&eacute;z ki:</P>

<CENTER><TABLE BGCOLOR="#FFFF00" >
<TR ALIGN=CENTER VALIGN=TOP>
<TD><IMG SRC="is11.gif" HSPACE=5 HEIGHT=30 WIDTH=30><BR>
Magamr&oacute;l</TD>

<TD><IMG SRC="is12.gif" HSPACE=5 HEIGHT=30 WIDTH=30><BR>
Munka</TD>

<TD><IMG SRC="is13.gif" HSPACE=5 HEIGHT=30 WIDTH=30><BR>
Szabadid&otilde;</TD>

<TD><IMG SRC="is14.gif" HSPACE=5 HEIGHT=30 WIDTH=30><BR>
Bar&aacute;tok</TD>

<TD><IMG SRC="is15.gif" HSPACE=5 HEIGHT=30 WIDTH=30><BR>
Kezd&otilde;lap</TD>

<TD><IMG SRC="is16.gif" HSPACE=5 HEIGHT=30 WIDTH=30><BR>
&Iacute;rj nekem!</TD>
</TR>
</TABLE></CENTER>

<P>Minden ikonhoz sz&ouml;veges magyar&aacute;zatot is kell f&ucirc;zn&ouml;d,
egyr&eacute;szt azok kedv&eacute;&eacute;rt, akik nem grafikus b&ouml;ng&eacute;sz&otilde;vel
olvass&aacute;k a lapodat, m&aacute;sr&eacute;szt azok kedv&eacute;&eacute;rt,
akik a rajzod jelent&eacute;s&eacute;t nem tudj&aacute;k megfejteni. Az
ikonok &eacute;s a sz&ouml;vegek olyan linkek legyenek, amelyek a hozz&aacute;juk
tartoz&oacute; oldalakra mutatnak!</P>

<P>Azt is lehet csin&aacute;lni, hogy az ikonsor csak sz&ouml;veget tartalmaz&oacute;
k&eacute;pekb&otilde;l &aacute;ll, valahogy &iacute;gy:</P>

<CENTER><TABLE>
<TR>
<TD><IMG SRC="is21.gif" ALT="Magamrol" HEIGHT=30 WIDTH=74></TD>

<TD><IMG SRC="is22.gif" ALT="Munka" HEIGHT=30 WIDTH=50></TD>

<TD><IMG SRC="is23.gif" ALT="Szabadido" HEIGHT=30 WIDTH=74></TD>

<TD><IMG SRC="is24.gif" ALT="Baratok" HEIGHT=30 WIDTH=57></TD>

<TD><IMG SRC="is25.gif" ALT="Kezdolap" HEIGHT=30 WIDTH=66></TD>

<TD><IMG SRC="is26.gif" ALT="Irj nekem!" HEIGHT=30 WIDTH=73></TD>
</TR>
</TABLE></CENTER>

<P>Ilyenkor els&otilde;sorban ara kell figyelni, hogy helyettes&iacute;t&otilde;
sz&ouml;vegk&eacute;nt (alternative text, ALT) mindig adjuk meg a k&eacute;pfile-okban
tal&aacute;lhat&oacute; sz&ouml;veges inform&aacute;ci&oacute;t, hiszen
a sz&ouml;veges b&ouml;ng&eacute;sz&otilde;t haszn&aacute;l&oacute;k en&eacute;lk&uuml;l
igen gyorsan elt&eacute;vedn&eacute;nek.</P>

<P>&Iacute;gy is felmer&uuml;l azonban egy probl&eacute;ma. Lehet, hogy
egy ikon ugyanarra az oldalra mutat, mint ahol az olvas&oacute; &eacute;ppen
&aacute;ll. P&eacute;ld&aacute;ul, ha a kezd&otilde;lap alj&aacute;n a
fent l&aacute;that&oacute; ikonsorb&oacute;l a &quot;Kezd&otilde;lap&quot;
ikonra b&ouml;k, ugyanaz az oldal fog let&ouml;lt&otilde;dni. Ez pedig,
ak&aacute;rmilyen logikus, furcsa lehet egy olyan olvas&oacute;nak, aki
ahhoz szokott, hogy ha egy linkre r&aacute;mutat, el&otilde;bbre fog jutni.</P>

<P>Viszont ha teljesen elt&uuml;ntetj&uuml;k az &eacute;ppen nem v&aacute;laszthat&oacute;
ikont, az is megzavarhatja a tapasztalatlan olvas&oacute;t, mivel minden
oldalon m&aacute;s sz&ouml;vegekkel fog tal&aacute;lkozni. Ez&eacute;rt
azt a megold&aacute;st tal&aacute;lt&aacute;k ki, hogy az &eacute;ppen
nem v&aacute;laszthat&oacute; ikon is a k&eacute;perny&otilde;re ker&uuml;l,
de m&aacute;s sz&iacute;nnel. (&Eacute;s term&eacute;szetesen nincs hozz&aacute;
linkelve semmi.) &Aacute;ltal&aacute;ban a sz&uuml;rke sz&iacute;nt szok&aacute;s
alkalmazni. P&eacute;ld&aacute;ul</P>

<UL>
<LI>a&nbsp;&quot;Magamr&oacute;l&quot; c&iacute;m&ucirc; oldalon tal&aacute;lhat&oacute;
ikonsor &iacute;gy n&eacute;zne ki:</LI>
</UL>

<CENTER><TABLE>
<TR>
<TD><IMG SRC="is212.gif" ALT="Magamrol" HEIGHT=30 WIDTH=74></TD>

<TD><IMG SRC="is22.gif" ALT="Munka" HEIGHT=30 WIDTH=50></TD>

<TD><IMG SRC="is23.gif" ALT="Szabadido" HEIGHT=30 WIDTH=74></TD>

<TD><IMG SRC="is24.gif" ALT="Baratok" HEIGHT=30 WIDTH=57></TD>

<TD><IMG SRC="is25.gif" ALT="Kezdolap" HEIGHT=30 WIDTH=66></TD>

<TD><IMG SRC="is26.gif" ALT="Irj nekem!" HEIGHT=30 WIDTH=73></TD>
</TR>
</TABLE></CENTER>

<UL>
<LI>a &quot;Munka&quot; oldalon lev&otilde; pedig &iacute;gy:</LI>
</UL>

<CENTER><TABLE>
<TR>
<TD><IMG SRC="is21.gif" ALT="Magamrol" HEIGHT=30 WIDTH=74></TD>

<TD><IMG SRC="is222.gif" ALT="Munka" HEIGHT=30 WIDTH=50></TD>

<TD><IMG SRC="is23.gif" ALT="Szabadido" HEIGHT=30 WIDTH=74></TD>

<TD><IMG SRC="is24.gif" ALT="Baratok" HEIGHT=30 WIDTH=57></TD>

<TD><IMG SRC="is25.gif" ALT="Kezdolap" HEIGHT=30 WIDTH=66></TD>

<TD><IMG SRC="is26.gif" ALT="Irj nekem!" HEIGHT=30 WIDTH=73></TD>
</TR>
</TABLE></CENTER>

<P>&Eacute;s &iacute;gy tov&aacute;bb.</P>

<P><B>Imagemap. </B>Az imagemap egyetlen k&eacute;p, amely r&eacute;szekre
van bontva. Minden r&eacute;szhez m&aacute;s web-oldal van hozz&aacute;linkelve.
Att&oacute;l f&uuml;gg&otilde;en, hogy a k&eacute;p melyik r&eacute;sz&eacute;re
kattint az olvas&oacute;, az ahhoz a r&eacute;szhez tartoz&oacute; oldalra
fog jutni.</P>

<P>Az imagemap el&otilde;&aacute;ll&iacute;t&aacute;s&aacute;hoz vagy egy
okos web-szerkeszt&otilde; sz&uuml;ks&eacute;ges, (amelyik tud imagemap-et
csin&aacute;lni), vagy egy grafikai program &eacute;s a HTML&nbsp;nyelv
ismerete. Az ikonsorokb&oacute;l is lehet imagemap-et k&eacute;sz&iacute;teni,
ha az ikonokat egyszer&ucirc;en egy k&eacute;pp&eacute; &aacute;ll&iacute;tod
&ouml;ssze:</P>

<CENTER><P><IMG SRC="is2.gif" HEIGHT=30 WIDTH=400></P></CENTER>

<P>majd meghat&aacute;rozod az egyes r&eacute;szeket, amelyekhez a k&uuml;l&ouml;nb&ouml;z&otilde;
linkek tartoznak.</P>

<P>A legegyszer&ucirc;bb imagemap-ek &iacute;gy n&eacute;znek ki, de ak&aacute;rmilyen
k&eacute;pb&otilde;l k&eacute;sz&iacute;thet&otilde; imagemap:</P>

<P><IMG SRC="im.gif" HEIGHT=150 WIDTH=200 ALIGN=LEFT>Itt p&eacute;ld&aacute;ul
az imagemap-hivatkoz&aacute;sok be&aacute;ll&iacute;that&oacute;k &uacute;gy,
hogy k&uuml;l&ouml;n oldalra jusson az olvas&oacute;, ha</P>

<UL>
<LI>az &eacute;gre,</LI>

<LI>a padl&aacute;sra,</LI>

<LI>az ablakra,</LI>

<LI>az ajt&oacute;ra</LI>

<LI>vagy a kertre kattint.</LI>
</UL>

<P>J&oacute; p&eacute;ld&aacute;t l&aacute;thatsz az imagemap-es navig&aacute;ci&oacute;ra
a <A HREF="http://www.poli.hu/">K&ouml;zgazdas&aacute;gi Politechnikum</A>
kezd&otilde;lapj&aacute;n.</P>

<P>Mint az ikonn&aacute;l, itt is sz&ouml;veges inform&aacute;ci&oacute;t
is kell mell&eacute;kelni. De az imagemap-n&eacute;l nem lehet a dolgot
a k&eacute;pet helyettes&iacute;t&otilde; sz&ouml;veggel megoldani, mert
az nem tartalmazhat linkeket. Teh&aacute;t azt &eacute;rdemes tenned, hogy
sz&ouml;vegesen is le&iacute;rod a lehets&eacute;ges linkeket. Vagy &uacute;gy,
hogy &iacute;rsz a k&eacute;pr&otilde;l egy n&eacute;h&aacute;ny sornyi
sz&ouml;veget, &eacute;s abban teszed linkk&eacute; a megfelel&otilde;
sz&ouml;vegr&eacute;szeket, vagy egyszer&ucirc;en csak felsorolod a linkeket.</P>

<P><B>Frame-ek.</B> A frame keretet, ablakot jelent. L&aacute;that&oacute;
vagy l&aacute;thatatlan vonalakkal oszthatod fel a&nbsp;k&eacute;perny&otilde;t
k&uuml;l&ouml;nb&ouml;z&otilde; ablakokra. Ha a k&eacute;perny&otilde;
egy bizonyos r&eacute;sz&eacute;re mindig ugyanazt az inform&aacute;ci&oacute;t
tervezed, f&uuml;ggetlen&uuml;l att&oacute;l, hogy az olvas&oacute; melyik
oldaladat n&eacute;zi, akkor a legegyszer&ucirc;bb erre a ter&uuml;letre
egy k&uuml;l&ouml;n frame-et kialak&iacute;tani.</P>

<P>A frame-ek nemcsak a navig&aacute;l&aacute;st seg&iacute;thetik, de
a leggyakrabban ez a feladatuk. A b&otilde;ng&eacute;sz&otilde; ablak&aacute;nak
valamelyik sz&eacute;l&eacute;re szok&aacute;s egy navig&aacute;ci&oacute;s
frame-et kialak&iacute;tani, amelyben helyet kaphat a navig&aacute;ci&oacute;s
ikonsor (illetve imagemap), &iacute;gy azt nem kell k&uuml;l&ouml;n minden
oldalra elhelyezni. Ebben a navig&aacute;ci&oacute;s frame-ben&nbsp;(vagy
egy m&aacute;sikban) helyet kaphat p&eacute;ld&aacute;ul a site embl&eacute;m&aacute;ja
is. A szerz&otilde; neve vagy m&aacute;s hasonl&oacute; technikai inform&aacute;ci&oacute;k
szint&eacute;n ide ker&uuml;lhetnek. Frame-ekkel k&eacute;sz&uuml;lt oldalra
<A HREF="frame.htm">itt l&aacute;thatsz p&eacute;ld&aacute;t</A>. </P>

<P>Minden frame-nek k&uuml;l&ouml;n neve van. Ha az egyik frame navig&aacute;ci&oacute;s
ikonokat tartalmaz, akkor azokat &uacute;gy kell linkk&eacute; tenni, hogy
az eredm&eacute;ny&uuml;k a m&aacute;sik frame-ben, a f&otilde;ablakban
l&aacute;tsz&oacute;djon. Ezt &uacute;gy lehet megcsin&aacute;lni, hogy
a link c&eacute;lj&aacute;nak (target param&eacute;ter&eacute;nek) a f&otilde;ablak
nev&eacute;t kell megadni. N&eacute;h&aacute;ny tov&aacute;bbi tipp a frame-ekhez:</P>

<UL>
<LI>Azt is be lehet &aacute;ll&iacute;tani, hogy az ablakok k&ouml;z&ouml;tti
keretek ne l&aacute;tsz&oacute;djanak.</LI>

<LI>Igyekezz min&eacute;l kevesebb frame-et haszn&aacute;lni, egyszerre
legfeljebb kett&otilde;t-h&aacute;rmat. K&uuml;l&ouml;nben az a vesz&eacute;ly
fenyeget, hogy az inform&aacute;ci&oacute; elv&eacute;sz a sok keret k&ouml;z&ouml;tt.</LI>

<LI>A r&eacute;gebbi t&iacute;pus&uacute; b&ouml;ng&eacute;sz&otilde;k
nem tudj&aacute;k helyesen megjelen&iacute;teni a frame-eket. Az ilyet
haszn&aacute;l&oacute; olvas&oacute;kra is gondolnod kell, ha frame-et
haszn&aacute;lsz:&nbsp;nekik egy k&uuml;l&ouml;n anyagot (&quot;noframe-inform&aacute;ci&oacute;t&quot;)
&iacute;rhatsz abba az oldalba, ahol a frame-eket defini&aacute;ltad. (N&eacute;zz
ut&aacute;na a web-szerkeszt&otilde;dben!)</LI>
</UL>

<P><B>Feladatok</B></P>

<OL>
<LI>K&eacute;sz&iacute;ts a f&otilde;bb web-oldalaidhoz k&eacute;pes vagy
sz&ouml;veges ikonokat!</LI>

<LI>Ha a web-szerkeszt&otilde;d k&eacute;pes r&aacute;, k&eacute;sz&iacute;ts
egy egyszer&ucirc;bb imagemap-et!</LI>

<LI>N&eacute;zd meg, hogy a web-szerkeszt&otilde;d k&eacute;pes-e frame-ek
szerkeszt&eacute;s&eacute;re. Ha igen, pr&oacute;b&aacute;ld ki a lehet&otilde;s&eacute;geket!</LI>
</OL>

<P>
<HR WIDTH="100%"></P>

<P><A HREF="grafika.htm">Vissza az el&otilde;z&otilde; lapra</A></P>

</BODY>
</HTML>
