<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
   <TITLE>Kapcsolattart&aacute;s az olvas&oacute;val</TITLE>
   <META NAME="Author" CONTENT="">
   <META NAME="GENERATOR" CONTENT="Mozilla/3.04Gold (Win95; I) [Netscape]">
</HEAD>
<BODY TEXT="#000000" BGCOLOR="#FFFFE8" LINK="#0000EE" VLINK="#551A8B" ALINK="#FF0000">

<H2 ALIGN=CENTER>Az oldalak karbantart&aacute;sa</H2>

<H3><B><I><FONT COLOR="#400040">Kapcsolattart&aacute;s az olvas&oacute;val</FONT></I></B></H3>

<P><FONT COLOR="#400040"><B>T&aacute;j&eacute;koztat&aacute;s.</B> Ha az
olvas&oacute; m&aacute;sodszor is megtiszteli figyelm&eacute;vel elk&eacute;sz&uuml;lt
oldalaidat, j&oacute;, ha m&aacute;r a c&iacute;mlapon visszat&eacute;r&otilde;
vend&eacute;gnek kij&aacute;r&oacute; b&aacute;n&aacute;sm&oacute;dban
r&eacute;szes&iacute;ted. Ez&eacute;rt a site-odon tett v&aacute;ltoztat&aacute;sokr&oacute;l
&eacute;rtes&iacute;tened kell az olvas&oacute;t, hogy tov&aacute;bbra
is el tudjon igazodni, &eacute;s megtudja, milyen &uacute;j anyagokat tal&aacute;lhat.
A kezd&otilde;lapon &aacute;ltal&aacute;ban meg szok&aacute;s jel&ouml;lni
a szerz&otilde; &aacute;ltal v&eacute;gzett utols&oacute; m&oacute;dos&iacute;t&aacute;s
id&otilde;pontj&aacute;t. Ebb&otilde;l az olvas&oacute; r&ouml;gt&ouml;n
megtudja, hogy a site-on tal&aacute;lhat&oacute; adatok mikori &aacute;llapotot
t&uuml;kr&ouml;znek, &eacute;s ker&uuml;lhetett-e f&ouml;l &uacute;j anyag,
ami&oacute;ta utolj&aacute;ra erre j&aacute;rt.</FONT></P>

<P><FONT COLOR="#400040">A kezd&otilde;lapra ennyi el&eacute;g is a m&oacute;dos&iacute;t&aacute;sokr&oacute;l.
Term&eacute;szetesen ha egy fontos &uacute;j oldalt k&eacute;sz&iacute;tesz,
azt c&eacute;lszer&ucirc; a ott rekl&aacute;mozni, de nem a kezd&otilde;lapon
kell r&eacute;szletezni, hogy pontosan mikor mi v&aacute;ltozott. Ezt az
inform&aacute;ci&oacute;t egy &quot;mi &uacute;js&aacute;g&quot;-nak vagy
&quot;utols&oacute; m&oacute;dos&iacute;t&aacute;sok&quot;-nak nevezett
lapon szokt&aacute;k le&iacute;rni a weboldal-k&eacute;sz&iacute;t&oacute;k.
Itt r&eacute;szletesen fel van sorolva, hogy melyik napon milyen v&aacute;ltoztat&aacute;sokat
tett a szerz&otilde; a site-on. A sorrendet c&eacute;lszer&ucirc; &uacute;gy
kialak&iacute;tani, hogy a legfrissebb v&aacute;ltoztat&aacute;s ker&uuml;lj&ouml;n
az oldal tetej&eacute;re, hogy a leg&uacute;jabb h&iacute;rek g&ouml;rget&eacute;s
n&eacute;lk&uuml;l is l&aacute;that&oacute;ak legyenek. Ugyanitt vagy egy
k&uuml;l&ouml;n oldalon meg&iacute;rhatod a site-tal kapcsolatos terveidet
is, ak&aacute;r grafikai, ak&aacute;r tartalmi k&eacute;rd&eacute;sekben.
Az olvas&oacute;nak &eacute;s neked is kellemes &eacute;rz&eacute;s azt
l&aacute;tni, hogy minden a tervek szerint halad.</FONT></P>

<P><FONT COLOR="#400040"><B>P&aacute;rbesz&eacute;d.</B> Az olvas&oacute;
t&aacute;j&eacute;koztat&aacute;sa csak minim&aacute;lis k&ouml;vetelm&eacute;ny.
A&nbsp;legjobb, ha az olvas&oacute; vissza is tud jelezni, te figyelembe
veszed a v&eacute;lem&eacute;ny&eacute;t, &eacute;s &iacute;gy, amit legk&ouml;zelebb
viszontl&aacute;t, abban egy kicsit az &otilde; v&eacute;lem&eacute;nye
is benne van. Ezt a fajta p&aacute;rbesz&eacute;det az&eacute;rt neh&eacute;z
kialak&iacute;tani, mert nemcsak az itt felsorolt tr&uuml;kk&ouml;ket kell
alkalmaznod hozz&aacute;, hanem sok m&uacute;lik p&eacute;ld&aacute;ul
a site-od st&iacute;lus&aacute;n &eacute;s a te hozz&aacute;&aacute;ll&aacute;sodon
is.</FONT></P>

<P><FONT COLOR="#400040">Az term&eacute;szetes, hogy kell egy link (a kezd&otilde;lapra
mindenk&eacute;ppen, de ak&aacute;r minden egyes oldalra is), amelyre b&ouml;kve
az olvas&oacute; levelet tud &iacute;rni neked. Ha hosszabb ideig nem olvasod
az e-mailjeidet, valahol &iacute;rd meg azt is, hogy hogyan lehet t&eacute;ged
&iacute;r&aacute;sban vagy telefonon el&eacute;rni. A&nbsp;site-tal kapcsolatos
terveidet vitasd meg az olvas&oacute;kkal! K&eacute;rd ki a v&eacute;lem&eacute;ny&uuml;ket,
k&iacute;n&aacute;lj fel v&aacute;laszt&aacute;si lehet&otilde;s&eacute;geket
&eacute;s szervezz e-mailes szavaz&aacute;st! Ha valaki javaslatot &iacute;r
neked, v&aacute;laszolj neki, f&uuml;ggetlen&uuml;l att&oacute;l, hogy
megfogadod-e a tan&aacute;cs&aacute;t. K&ouml;sz&ouml;nd meg a seg&iacute;ts&eacute;g&eacute;t,
&eacute;s &iacute;rd meg neki, hogy tudod-e, akarod-e alkalmazni az elk&eacute;pzel&eacute;seit!&nbsp;Ha
nem, indokold meg!</FONT></P>

<P><FONT COLOR="#400040"><B>Programok.</B> Egyre t&ouml;bb site-on van
vend&eacute;gk&ouml;nyv, amelybe&nbsp;az olvas&oacute;k egy linken kereszt&uuml;l
tudnak e-mailes bejegyz&eacute;seket &iacute;rni. A&nbsp;vend&eacute;gk&ouml;nyv
egy program, amely ezeket a leveleket feldolgozza, &eacute;s egy web-oldall&aacute;
gy&uacute;rja &ouml;ssze &otilde;ket. Sajnos az ilyen programok k&eacute;sz&iacute;t&eacute;s&eacute;hez
&eacute;s elhelyez&eacute;s&eacute;hez programoz&aacute;si ismeretekre
&eacute;s rendszergazdai enged&eacute;lyre van sz&uuml;ks&eacute;ged. Vend&eacute;gk&ouml;nyvre
p&eacute;ld&aacute;t tal&aacute;lhatsz t&ouml;bbek k&ouml;z&ouml;tt a <A HREF="http://www.nyitok.hu/relax/">Relax!&nbsp;Magazin</A>n&aacute;l.</FONT></P>

<P><FONT COLOR="#400040">Ha az olvas&oacute;kt&oacute;l visszajelz&eacute;st
szeretn&eacute;l kapni, vagy k&uuml;l&ouml;nb&ouml;z&otilde; adatok megad&aacute;s&aacute;ra
k&eacute;red &otilde;ket, praktikus &ucirc;rlapot k&eacute;sz&iacute;tened.
Ez olyan weblapot jelent, amely ki lehet eg&eacute;sz&iacute;tve nyom&oacute;gombokkal,
kit&ouml;lthet&otilde; sz&ouml;vegdobozokkal, leg&ouml;rd&uuml;l&otilde;
list&aacute;val, r&aacute;di&oacute;gombokkal &eacute;s jel&ouml;l&otilde;n&eacute;gyzetekkel.
(&Ucirc;rlapot t&ouml;ltesz ki p&eacute;ld&aacute;ul, amikor egy keres&otilde;site-on
be&iacute;rod a keresett sz&oacute;t a sz&ouml;vegdobozba &eacute;s megnyomod
a &quot;keres&eacute;s&quot; gombot.) &Ucirc;rlapot ak&aacute;rmelyik jobb
webszerkeszt&otilde; programmal k&eacute;sz&iacute;thetsz, viszont az &ucirc;rlap
ki&eacute;rt&eacute;kel&eacute;se (az, hogy t&ouml;rt&eacute;njen is valami,
ha az olvas&oacute; lenyomja az OK gombot) ism&eacute;t csak programoz&aacute;ssal
lehets&eacute;ges.</FONT></P>

<P>
<HR WIDTH="100%"><A HREF="Karban.htm">Vissza az el&otilde;z&otilde; lapra</A></P>

</BODY>
</HTML>
