<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
   <TITLE>Karbantart&aacute;si tippek</TITLE>
   <META NAME="Author" CONTENT="">
   <META NAME="GENERATOR" CONTENT="Mozilla/3.04Gold (Win95; I) [Netscape]">
</HEAD>
<BODY TEXT="#000000" BGCOLOR="#FFFFE8" LINK="#0000EE" VLINK="#551A8B" ALINK="#FF0000">

<H2 ALIGN=CENTER>Az oldalak karbantart&aacute;sa</H2>

<H3><I><FONT COLOR="#400040">Karbantart&aacute;si tippek</FONT></I></H3>

<UL>
<LI><FONT COLOR="#400040">A&nbsp;site elk&eacute;sz&uuml;lte &eacute;s
minden l&eacute;nyegi v&aacute;ltoztat&aacute;s ut&aacute;n tesztelj!&nbsp;Ehhez
lehet&otilde;leg k&uuml;l&ouml;nb&ouml;z&otilde; oper&aacute;ci&oacute;s
rendszereken fut&oacute; (DOS, Windows 95, Unix, MacOS) &eacute;s k&uuml;l&ouml;nb&ouml;z&otilde;
t&iacute;pus&uacute; (Netscape, Explorer, Lynx) b&ouml;ng&eacute;sz&otilde;ket
is pr&oacute;b&aacute;lj ki. K&uuml;l&ouml;n&ouml;sen arra figyelj, hogy
sz&ouml;veges b&ouml;ng&eacute;sz&otilde;vel is &eacute;lvezhet&otilde;-e
a site, &eacute;s hogy a sz&iacute;nek nem cs&uacute;ny&aacute;k-e 256
sz&iacute;nben vagy monokrom monitoron. Ellen&otilde;rizd rendszeresen
az &ouml;sszes linket &eacute;s azt, hogy az egyes oldalak nem t&ouml;lt&otilde;dnek-e
le t&uacute;l lassan.</FONT></LI>

<LI><FONT COLOR="#400040">Ne tedd ki a &quot;fel&uacute;j&iacute;t&aacute;s
alatt&quot; jelet!&nbsp;Ha egy oldalt vagy a site egy r&eacute;sz&eacute;t
&aacute;tszervezed, z&aacute;rd le az olvas&oacute;k el&otilde;l, vedd
ki a linket, amelyen kereszt&uuml;l megk&ouml;zel&iacute;thet&otilde;.
Azt pedig, hogy egyszer&ucirc;en friss&iacute;t&eacute;sre v&aacute;r egy
oldal, f&ouml;l&ouml;sleges k&uuml;l&ouml;n jelezned: ez mag&aacute;t&oacute;l
&eacute;rtet&otilde;dik. Ebb&otilde;l a szempontb&oacute;l minden website
&aacute;lland&oacute;an fel&uacute;j&iacute;t&aacute;s alatt &aacute;ll.</FONT></LI>

<LI><FONT COLOR="#400040">A l&aacute;togat&oacute;k sz&aacute;m&aacute;t
sokan nyilv&aacute;ntartj&aacute;k (&eacute;s a c&iacute;mlapon kijelzik)
egy sz&aacute;ml&aacute;l&oacute; seg&iacute;ts&eacute;g&eacute;vel. Ahhoz,
hogy a sz&aacute;ml&aacute;l&oacute; t&eacute;nyleg azt mutassa, hogy h&aacute;nyan
l&aacute;togatt&aacute;k a site-odat, futnia kell egy programnak. R&aacute;ad&aacute;sul
ez az adat &iacute;gy is manipul&aacute;lhat&oacute;, &eacute;s a kezdeti
id&otilde;kben, am&iacute;g a site-odat kevesen l&aacute;togatj&aacute;k,
a sz&aacute;ml&aacute;l&oacute; csak elriasztja az olvas&oacute;kat. Hagyd
meg a sz&aacute;ml&aacute;l&oacute;t a profi site-oknak!</FONT></LI>

<LI><FONT COLOR="#400040">K&iacute;s&eacute;rletezz &uacute;j technol&oacute;gi&aacute;kkal!
N&eacute;zz sz&eacute;t az Interneten, &eacute;s ha egy oldalon olyan m&oacute;dszert,
tr&uuml;kk&ouml;t l&aacute;tsz, amelyet m&eacute;g nem ismersz, vagy nem
tudod, hogyan lehet megoldani, n&eacute;zd meg a forr&aacute;sk&oacute;dj&aacute;t!&nbsp;(View
Source.) Ehhez m&aacute;r sz&uuml;ks&eacute;ged van HTML&nbsp;&eacute;s
esetleg Java ismeretekre is. Miel&otilde;tt &aacute;tveszel &uacute;j m&oacute;dszereket,
m&eacute;rlegeld, hogy te mint olvas&oacute; praktikusnak tartod-e, seg&iacute;ts&eacute;gedre
van-e a navig&aacute;l&aacute;sban, az olvasgat&aacute;sban.</FONT></LI>

<LI><FONT COLOR="#400040">Szakmai k&eacute;rd&eacute;sekben legy&eacute;l
naprak&eacute;sz! Tanulm&aacute;nyozd az Internetes szaklapokat, a sz&aacute;m&iacute;t&aacute;stechnikai
lapok Internettel foglalkoz&oacute; cikkeit &eacute;s a webmestereknek
sz&oacute;l&oacute; levelez&eacute;si list&aacute;kat, internetes f&oacute;rumokat.
(P&eacute;ld&aacute;ul az Internetto tanfolyamait vagy a HIX&nbsp;Webmester
rovat&aacute;t.)</FONT></LI>
</UL>

<P>
<HR WIDTH="100%"><A HREF="Karban.htm">Vissza az el&otilde;z&otilde; lapra</A></P>

</BODY>
</HTML>
