<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
   <TITLE>Mire lehet j&oacute; egy szem&eacute;lyes website?</TITLE>
   <META NAME="Author" CONTENT="">
   <META NAME="GENERATOR" CONTENT="Mozilla/3.04Gold (Win95; I) [Netscape]">
</HEAD>
<BODY TEXT="#000000" BGCOLOR="#FFFFE8" LINK="#0000EE" VLINK="#551A8B" ALINK="#FF0000">

<H2 ALIGN=CENTER>Oldalaink megtervez&eacute;se, el&otilde;k&eacute;sz&iacute;t&eacute;se</H2>

<H3><I>Mire lehet j&oacute; egy szem&eacute;lyes website?</I></H3>

<P><B>Megtal&aacute;lni egym&aacute;st.</B> Tegy&uuml;k fel, hogy megismerkedt&eacute;l
valakivel egy t&aacute;borban, buliban, koncerten, stb. Valamilyen okb&oacute;l
meg szeretn&eacute;d tal&aacute;lni. A teljes nev&eacute;re, c&iacute;m&eacute;re,
telefonsz&aacute;m&aacute;ra m&aacute;r nem eml&eacute;kszel (esetleg t&ouml;bb
&eacute;ve t&ouml;rt&eacute;nt a dolog), csak p&eacute;ld&aacute;ul a keresztnev&eacute;re,
a hobbij&aacute;ra, &eacute;s arra, hogy melyik iskol&aacute;ba j&aacute;r.
Ha van neki szem&eacute;lyes website-ja, ennyi inform&aacute;ci&oacute;
m&aacute;r b&otilde;ven el&eacute;g neked ahhoz, hogy (egy Internet-keres&otilde;
seg&iacute;ts&eacute;g&eacute;vel) megtal&aacute;lhasd. Hasonl&oacute;an,
ha t&eacute;ged szeretne valaki megtal&aacute;lni, akkor j&oacute;l j&ouml;het,
ha van egy szem&eacute;lyes website-od, amely tartalmazza a t&eacute;ged
jellemz&otilde; adatokat.</P>

<P><B>Megismerkedni azokkal, akik seg&iacute;teni tudnak. </B>Az Internet
k&ouml;zelebb hozza egym&aacute;shoz az embereket: saj&aacute;t site-odon
kereszt&uuml;l megismerhetnek olyan emberek, akikkel am&uacute;gy sosem
tal&aacute;lkozn&aacute;l, de esetleg hasonl&oacute; az &eacute;rdekl&otilde;d&eacute;si
k&ouml;r&ouml;t&ouml;k, vagy valamilyen &uuml;gyben seg&iacute;teni tudtok
egym&aacute;snak, p&eacute;ld&aacute;ul v&eacute;lem&eacute;nyetek vagy
tapasztalatotok kicser&eacute;l&eacute;s&eacute;vel. (P&eacute;ld&aacute;ul
ha t&ouml;bb &eacute;vig B&eacute;csben &eacute;lt&eacute;l, &eacute;s
valaki, aki oda k&eacute;sz&uuml;l k&ouml;lt&ouml;zni, megtal&aacute;lja
az oldaladat, akkor kapcsolatba l&eacute;phet veled, &eacute;s megk&eacute;rdezheti
t&otilde;led, hogy hol lehet j&oacute; pizz&aacute;t enni, kihez fordulhat
seg&iacute;ts&eacute;g&eacute;rt ilyen-olyan &uuml;gyekben, &eacute;s &iacute;gy
tov&aacute;bb.) Ugyan&iacute;gy te is kereshetsz a Weben olyan embereket,
akik valamilyen probl&eacute;m&aacute;d megold&aacute;s&aacute;ban, valamilyen
k&eacute;rd&eacute;sed megv&aacute;laszol&aacute;s&aacute;ban a seg&iacute;ts&eacute;gedre
lehetnek.</P>

<P><B>Hasznos inform&aacute;ci&oacute;k k&ouml;zz&eacute;t&eacute;tele.</B>
Nem csak idegeneken seg&iacute;thet, ha van website-od. P&eacute;ld&aacute;ul
ha le&iacute;rod, hogy milyen j&aacute;rm&ucirc;vekkel hogyan lehet eljutni
hozz&aacute;tok, ha valaki vend&eacute;gs&eacute;gbe akar j&ouml;nni (esetleg
kis rajzot is mell&eacute;kelsz), ismer&otilde;seid nem fognak mindig &uacute;jra
&eacute;s &uacute;jra megk&eacute;rni, hogy magyar&aacute;zd el. S&otilde;t,
ha &eacute;ppen nem vagy el&eacute;rhet&otilde;, &otilde;k akkor is meg
tudj&aacute;k n&eacute;zni, esetleg ki is tudj&aacute;k nyomtatni ezt a
sz&aacute;mukra fontos inform&aacute;ci&oacute;t. Ehhez hasonl&oacute;an
b&aacute;rmit megoszthatsz a nagyvil&aacute;ggal, ismeretlenekkel &eacute;s
ismer&otilde;s&ouml;kkel egyar&aacute;nt.</P>

<P><B>Seg&iacute;t &ouml;sszeszedni a gondolataidat.</B> A site-od szerkeszt&eacute;se
sor&aacute;n sokszor megeshet, hogy mondanival&oacute;dat t&ouml;m&ouml;ren,
szabatosan kell megfogalmaznod. De a web nemcsak az &iacute;r&aacute;s
gyakorl&aacute;s&aacute;ban seg&iacute;thet, hanem olvas&oacute;id visszajelz&eacute;seib&otilde;l
is sokat tanulhatsz, &eacute;s lehet&otilde;s&eacute;ged ny&iacute;lik
a hib&aacute;id kijav&iacute;t&aacute;s&aacute;ra.</P>

<P><B>Feladatok</B></P>

<OL>
<LI>Tal&aacute;lj ki egy olyan inform&aacute;ci&oacute;t, amit m&aacute;r
r&eacute;gen szerett&eacute;l volna megtudni, de m&eacute;g sosem siker&uuml;lt,
vagy mindig elfelejtetted. (Lehet ez egy adat, mint p&eacute;ld&aacute;ul
hogy h&aacute;ny m&eacute;ter magas az Orsz&aacute;gh&aacute;z, de lehet
p&eacute;ld&aacute;ul egy elt&ucirc;nt ismer&otilde;s&ouml;d is, vagy egy
sz&oacute;rakoz&oacute;hely c&iacute;me.)&nbsp;A feladat ezt megtal&aacute;lnod
a k&uuml;l&ouml;nb&ouml;z&otilde; keres&otilde;k seg&iacute;ts&eacute;g&eacute;vel
a weben.</LI>

<LI>Gondold v&eacute;gig, hogy &aacute;ltal&aacute;ban v&eacute;ve te milyen
jelleg&ucirc; inform&aacute;ci&oacute;kat tenn&eacute;l k&ouml;zre magadr&oacute;l
a weben!</LI>
</OL>

<P>
<HR WIDTH="100%"><BR>
<A HREF="TERVEZ.HTM">Vissza az el&otilde;z&otilde; lapra</A></P>

</BODY>
</HTML>
