<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
   <TITLE>Tov&aacute;bbi tippek</TITLE>
   <META NAME="Author" CONTENT="">
   <META NAME="GENERATOR" CONTENT="Mozilla/3.04Gold (Win95; I) [Netscape]">
</HEAD>
<BODY TEXT="#000000" BGCOLOR="#FFFFE8" LINK="#0000EE" VLINK="#551A8B" ALINK="#FF0000">

<H2 ALIGN=CENTER>Oldalaink megtervez&eacute;se, el&otilde;k&eacute;sz&iacute;t&eacute;se</H2>

<H3><I>Tov&aacute;bbi tippek</I></H3>

<P>Mikor id&aacute;ig eljutott&aacute;l, olvasd &aacute;t az oldalaidat
a k&ouml;vetkez&otilde; szempontok szerint.</P>

<P><B>Milyenek a web-olvas&oacute;k?</B> </P>

<UL>
<LI>&Aacute;ltal&aacute;ban el&eacute;g szigor&uacute; kritikusok, &eacute;s
nem jelent n&aacute;luk j&oacute; pontot, ha egy site tele van helyes&iacute;r&aacute;si
hib&aacute;val vagy t&eacute;ved&eacute;sekkel. Teh&aacute;t a szerkeszt&eacute;s
&eacute;s oldalaid &ouml;sszekapcsol&aacute;sa ut&aacute;n most itt az
ideje, hogy kijav&iacute;tsd a hib&aacute;kat. Gondosan olvasd v&eacute;gig
a teljes sz&ouml;veget, &eacute;s b&aacute;nj el a hib&aacute;kkal, a t&eacute;ved&eacute;sekkel,
&eacute;s a k&ouml;r&uuml;lm&eacute;nyesen megfogalmazott, nehezen &eacute;rthet&otilde;
mondatokkal! Sz&aacute;nd r&aacute; az id&otilde;t!</LI>

<LI>Szeretik maguk kialak&iacute;tani a v&eacute;lem&eacute;ny&uuml;ket.
Te is le&iacute;rhatod a magad&eacute;t, de ne hangs&uacute;lyozz t&uacute;l
semmit, mert ezzel az ellenkez&otilde; hat&aacute;st &eacute;rheted el.
A t&eacute;nyek &aacute;ltal&aacute;ban &ouml;nmaguk&eacute;rt besz&eacute;lnek:
tedd az olvas&oacute; el&eacute; a t&eacute;nyeket, &eacute;s b&iacute;zd
r&aacute; a d&ouml;nt&eacute;st. Ugyan&iacute;gy ne dics&eacute;rd a saj&aacute;t
site-odat: ha j&oacute;, az &uacute;gyis l&aacute;tszik.</LI>

<LI>Az Interneten az emberek a legt&ouml;bbet (legal&aacute;bbis most m&eacute;g)
&iacute;r&aacute;sban kommunik&aacute;lnak. Levelekben, web-oldalakon neh&eacute;z
&aacute;tadni a t&eacute;m&aacute;nkhoz tartoz&oacute; &eacute;rzelmi t&ouml;ltetet,
hiszen hi&aacute;nyoznak az &eacute;l&otilde;sz&oacute;n&aacute;l rendelkez&eacute;sre
&aacute;ll&oacute; metakommunik&aacute;ci&oacute;s eszk&ouml;z&ouml;k.
(R&eacute;szletesebb magyar&aacute;zatot a magyar nyelv tananyag&aacute;ban
tal&aacute;lhatsz.) Ezt az Interneten k&uuml;l&ouml;nf&eacute;le &aacute;ltal&aacute;nosan
haszn&aacute;lt jel&ouml;l&eacute;sekkel szok&aacute;s megoldani. Ez a
t&aacute;bl&aacute;zat ezekb&otilde;l ad &iacute;zel&iacute;t&otilde;t:</LI>

<CENTER><TABLE BORDER=1 >
<TR>
<TH>Jel&ouml;l&eacute;s</TH>

<TH>Jelent&eacute;se</TH>
</TR>

<TR>
<TD ALIGN=LEFT VALIGN=TOP>CSUPA&nbsp;NAGYBET&Ucirc;</TD>

<TD ALIGN=LEFT VALIGN=TOP>Kiab&aacute;l&aacute;s (csak k&uuml;l&ouml;nleges
esetben alkalmazzuk).</TD>
</TR>

<TR>
<TD ALIGN=LEFT VALIGN=TOP>_hangs&uacute;lyozom_</TD>

<TD ALIGN=LEFT VALIGN=TOP>A sz&oacute;k&ouml;z helyett &iacute;rt al&aacute;h&uacute;z&aacute;s
azt jel&ouml;li, hogy lassan, tagoltan besz&eacute;l&uuml;nk, minden egyes
sz&oacute;t k&uuml;l&ouml;n kihangs&uacute;lyozunk.</TD>
</TR>

<TR>
<TD ALIGN=LEFT VALIGN=TOP>:-)</TD>

<TD ALIGN=LEFT VALIGN=TOP>Mosoly (angolul smiley). Ha valamit viccnek sz&aacute;nunk,
ezt &iacute;rjuk m&ouml;g&eacute;, k&uuml;l&ouml;n&ouml;sen akkor, ha k&uuml;l&ouml;nben
f&eacute;lre&eacute;rt&eacute;s sz&aacute;rmazhat bel&otilde;le.</TD>
</TR>

<TR>
<TD>:-(</TD>

<TD>Szomor&uacute;s&aacute;gunkat fejezhetj&uuml;k ki ezzel az &aacute;br&aacute;val.</TD>
</TR>
</TABLE></CENTER>

<P>Tov&aacute;bbi hasonl&oacute; jel&ouml;l&eacute;sekkel tele van a web.
De ne feledd:&nbsp;sokszor egy &uuml;gyesen megfogalmazott mondat p&oacute;tolja
a jeleket.</P>
</UL>

<P><B>A linkekr&otilde;l</B></P>

<UL>
<LI>Helyezz el k&uuml;ls&otilde; linkeket! Az oldalaid hivatkoznak egym&aacute;sra,
de a site &uacute;gy teljes, ha m&aacute;s site-okra is van benne hivatkoz&aacute;s.
P<FONT COLOR="#000000">&eacute;l</FONT>d&aacute;ul, tegy&eacute;l linket
az iskol&aacute;d website-j&aacute;ra ott, ahol az iskol&aacute;r&oacute;l
esik sz&oacute;, vagy ugyanezt megteheted m&aacute;s emberek, int&eacute;zm&eacute;nyek,
v&aacute;llalatok, esem&eacute;nyek website-j&aacute;val is, ha a sz&ouml;vegben
sz&oacute; esik r&oacute;luk. </LI>

<LI>Nem &aacute;rt, ha a sz&ouml;vegk&ouml;rnyezetb&otilde;l k&ouml;r&uuml;lbel&uuml;l
kider&uuml;l, hogy a linkre kattintva hov&aacute; ker&uuml;l az olvas&oacute;.
</LI>

<LI>Az, hogy egy mondatnak mely r&eacute;sz&eacute;t teszed linkk&eacute;,
legyen v&aacute;ltozatos! P&eacute;ld&aacute;ul:</LI>
</UL>

<CENTER><TABLE BORDER=1 WIDTH="80%" >
<TR>
<TH>Unalmas</TH>

<TH>&Eacute;rdekesebb</TH>
</TR>

<TR>
<TD><U><FONT COLOR="#0000FF">Itt</FONT></U> l&aacute;thatsz egy k&eacute;pet
az iskol&aacute;mr&oacute;l.</TD>

<TD>Van egy k&eacute;pem <U><FONT COLOR="#0000FF">az iskol&aacute;m</FONT></U>r&oacute;l.</TD>
</TR>

<TR>
<TD><U><FONT COLOR="#0000FF">Ide</FONT></U> kattintva &iacute;rhatsz nekem
levelet.</TD>

<TD><U><FONT COLOR="#0000FF">&Iacute;rj</FONT></U> nekem!</TD>
</TR>

<TR>
<TD><U><FONT COLOR="#0000FF">Itt</FONT></U> olvashatsz a bulimr&oacute;l.</TD>

<TD>Olvass egy <U><FONT COLOR="#0000FF">fantasztikus buli</FONT></U>r&oacute;l!</TD>
</TR>
</TABLE></CENTER>

<UL>
<LI>Sokan szeretnek k&uuml;l&ouml;n oldalt l&eacute;trehozni, rajtuk a
kedvenc linkjeikkel. (Ezt h&iacute;vj&aacute;k bookmark page-nek.) Ha te
is ilyet csin&aacute;lsz, nem &aacute;rt az egyes hivatkoz&aacute;sok mell&eacute;
p&aacute;r sort &iacute;rnod arr&oacute;l, hogy mit tartalmaz a site, mit
szeretsz rajta, milyennek tartod. Ez seg&iacute;t az olvas&oacute;id figyelm&eacute;t
felkelteni. Egy ilyen oldallal egy&eacute;bk&eacute;nt a saj&aacute;t webes
navig&aacute;l&aacute;sodat is megk&ouml;nny&iacute;theted.</LI>
</UL>

<P><B>Az anyagok st&iacute;lusa.</B> A sz&ouml;vegek megfogalmaz&aacute;sakor,
az inform&aacute;ci&oacute; elhelyez&eacute;sekor figyelj ezekre a szempontokra:</P>

<UL>
<LI>Az oldalaid t&eacute;ged jellemeznek. Aki nem ismer, &eacute;s &uacute;gy
olvassa a site-odat, ennek alapj&aacute;n fog meg&iacute;t&eacute;lni.
A sz&oacute;haszn&aacute;latban, a st&iacute;lusban l&eacute;gy &ouml;nmagad,
ett&otilde;l lesz a site jellegzetesen a ti&eacute;d.</LI>

<LI>Mindig az olvas&oacute; &eacute;rdekeit is tartsd szem el&otilde;tt,
pr&oacute;b&aacute;lj az &otilde; fej&eacute;vel gondolkozni. A site-on
seg&iacute;tened kell az olvas&oacute; navig&aacute;l&aacute;s&aacute;t.
M&aacute;r a tervez&eacute;skor m&eacute;rd fel, hogy szerinted kik alkotj&aacute;k
majd az olvas&oacute;t&aacute;bort, &eacute;s ennek megfelel&otilde;en
alak&iacute;tsd ki a site l&aacute;tv&aacute;ny&aacute;t, szerkezet&eacute;t.
Ez a k&eacute;s&otilde;bbiekben, a site karbantart&aacute;sakor is fontos
lesz.</LI>

<LI>A kuty&aacute;t sem &eacute;rdekl&otilde; &eacute;s sz&aacute;modra
is jelent&eacute;ktelen adatokra ne pazarold a rendelkez&eacute;sre &aacute;ll&oacute;
helyet.</LI>

<LI>Tart&oacute;zkodj az &iacute;zl&eacute;stelen megnyilv&aacute;nul&aacute;sokt&oacute;l.
Ne s&eacute;rtegess m&aacute;sokat, k&uuml;l&ouml;n&ouml;sen ne az illet&otilde;k
tudta n&eacute;lk&uuml;l.</LI>

<LI>Ne k&ouml;z&ouml;lj a site-on olyan anyagot, amelynek k&ouml;zl&eacute;s&eacute;t
az Internet-szolg&aacute;ltat&oacute; szab&aacute;lyzata (vagy az iskola
h&aacute;zirendje) tiltja, illetve amelynek k&ouml;zl&eacute;se jogszab&aacute;lyt
vagy t&ouml;rv&eacute;nyt s&eacute;rt. Ha nem vagy tiszt&aacute;ban ezekkel
a szab&aacute;lyzatokkal, n&eacute;zz ut&aacute;nuk!</LI>

<LI>Amikor v&eacute;lem&eacute;nyt &iacute;rsz valamir&otilde;l, &uuml;gyelj
arra, hogy a st&iacute;lusa ne legyen goromba, lehet&otilde;leg ne b&aacute;nts
meg vele m&aacute;sokat, akik nem ugyan&uacute;gy v&eacute;lekednek a dologr&oacute;l,
mint te.</LI>
</UL>

<P><B>Feladatok</B></P>

<OL>
<LI>Jav&iacute;tsd ki a site-od helyes&iacute;r&aacute;si, nyelvtani hib&aacute;it!
Ha valamiben nem vagy biztos, n&eacute;zz ut&aacute;na a Helyes&iacute;r&aacute;si
sz&oacute;t&aacute;rban!</LI>

<LI>Keress az Interneten a p&eacute;ld&aacute;khoz hasonl&oacute;, metakommunik&aacute;ci&oacute;t
helyettes&iacute;t&otilde; jeleket, a jelent&eacute;s&uuml;kkel egy&uuml;tt!
(K&uuml;l&ouml;n&ouml;sen a Useneten tal&aacute;lkozhatsz sok ilyennel.)</LI>

<LI>A Zsargon c&iacute;m&ucirc; k&ouml;nyvb&otilde;l vagy az Internetto
<A HREF="http://zsargon.internetto.hu/">Zsargon</A> rovat&aacute;b&oacute;l
ismerkedj az Internet-felhaszn&aacute;l&oacute;k nyelvezet&eacute;vel!</LI>

<LI>Keress a site-oddal kapcsolatba hozhat&oacute; linkeket! Ha sok ilyen
k&uuml;ls&otilde; linked vagy kedves site-od van, &iacute;rd &ouml;ssze
a c&iacute;m&uuml;ket, hogy ezekb&otilde;l egy k&uuml;l&ouml;n &quot;kedvenc
linkek&quot; oldalt k&eacute;sz&iacute;thess!</LI>

<LI>N&eacute;zz ut&aacute;na a r&aacute;d &eacute;rv&eacute;nyes h&aacute;l&oacute;zati
szab&aacute;lyzatnak!&nbsp;Keress a weben h&aacute;l&oacute;zati szab&aacute;lyzatokat,
&eacute;s hasonl&iacute;tsd &otilde;ket &ouml;ssze!</LI>
</OL>

<P>
<HR WIDTH="100%"><BR>
<A HREF="TERVEZ.HTM">Vissza az el&otilde;z&otilde; lapra</A></P>

</BODY>
</HTML>
