<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
   <TITLE>Szerkeszt&eacute;s</TITLE>
   <META NAME="Author" CONTENT="">
   <META NAME="GENERATOR" CONTENT="Mozilla/3.04Gold (Win95; I) [Netscape]">
</HEAD>
<BODY TEXT="#000000" BGCOLOR="#FFFFE8" LINK="#0000EE" VLINK="#551A8B" ALINK="#FF0000">

<H2 ALIGN=CENTER>Oldalaink megtervez&eacute;se, el&otilde;k&eacute;sz&iacute;t&eacute;se</H2>

<H3><I>Szerkeszt&eacute;s</I></H3>

<P><B>Szedd &ouml;ssze, amid van!</B> Most n&eacute;zz&uuml;k v&eacute;gig,
hogy hogyan lehet a rendelkez&eacute;sre &aacute;ll&oacute; adathalmazb&oacute;l
egy j&oacute;l fel&eacute;p&iacute;tett site-ot kialak&iacute;tani. El&otilde;sz&ouml;r
arra gondolj, hogy mit fognak tartalmazni az egyes oldalak. Ebben nagy
seg&iacute;ts&eacute;gedre van, ha &iacute;rsz egy list&aacute;t a rendelkez&eacute;sedre
&aacute;ll&oacute; file-okr&oacute;l. P&eacute;ld&aacute;ul:</P>

<CENTER><TABLE BORDER=1 >
<TR>
<TD>en.txt</TD>

<TD>peti.txt</TD>

<TD>csalad.txt</TD>

<TD>cica.gif</TD>
</TR>

<TR>
<TD>iskola.jpg</TD>

<TD>zene.txt</TD>

<TD>film.txt</TD>

<TD>lakas.txt</TD>
</TR>
</TABLE></CENTER>

<P>Ezek ut&aacute;n az lesz a dolgod, hogy elrendezgesd a file-okat, m&eacute;gpedig
nagyon hasonl&oacute;an ahhoz, mintha k&ouml;nyvt&aacute;rakba csoportos&iacute;tan&aacute;d
&otilde;ket. Vedd el&otilde; a k&ouml;nyvt&aacute;rstrukt&uacute;r&aacute;val
kapcsolatos eml&eacute;keidet, &eacute;s az el&otilde;z&otilde; lista alapj&aacute;n
k&eacute;sz&iacute;ts az &aacute;br&aacute;n l&aacute;that&oacute;hoz hasonl&oacute;
rajzot:</P>

<CENTER><P><IMG SRC="szerk1.gif" ALT="Szerkezeti rajz a file-ok elhelyezésérõl" HEIGHT=270 WIDTH=420><BR>
<B><FONT SIZE=-1>1. &aacute;bra</FONT></B></P></CENTER>

<P>Ez persze egy nagyon leegyszer&ucirc;s&iacute;tett p&eacute;lda; lehet,
hogy te t&ouml;bb file-lal gazd&aacute;lkodsz, t&ouml;bb kateg&oacute;ri&aacute;t
kell k&eacute;sz&iacute;tened, &eacute;s &iacute;gy t&ouml;bb oldalt kell
majd l&eacute;trehoznod. Ne ijedj meg, ha a feladat nagyobb! El&eacute;g
el&otilde;sz&ouml;r csak a file-ok egy r&eacute;sz&eacute;t elhelyezned,
k&eacute;s&otilde;bb m&eacute;g hozz&aacute;teheted a site-hoz az els&otilde;
k&ouml;rben kimaradt holmikat.</P>

<P><B>A kezd&otilde;lap szerepe.</B> Az 1. &aacute;br&aacute;n egy keret
egy web-oldalt jel&ouml;l. Az &aacute;br&aacute;t vizsg&aacute;lva l&aacute;thatod,
hogy a kezd&otilde;lapra tov&aacute;bbi linkeket kell majd elhelyezni,
a csal&aacute;dr&oacute;l, a haverokr&oacute;l &eacute;s a hobbir&oacute;l
sz&oacute;l&oacute; oldalakra. Ez &iacute;gy is van rendj&eacute;n. Egy
site kezd&otilde;lapja arra val&oacute;, hogy &uuml;dv&ouml;z&ouml;lje
az olvas&oacute;t, &eacute;s bemutassa az ott tal&aacute;lhat&oacute; anyagokat,
seg&iacute;tsen eligazodni. A t&eacute;m&aacute;k r&eacute;szletes kifejt&eacute;s&eacute;be
r&aacute;&eacute;rsz a k&eacute;s&otilde;bbi oldalakon belefogni. Nem szerencs&eacute;s,
ha m&aacute;r a kezd&otilde;lapon g&ouml;rgetni kell a sz&ouml;veget, mivel
ez a navig&aacute;l&aacute;st lass&iacute;tja, &eacute;s esetleg teljesen
elveszi az olvas&oacute; kedv&eacute;t a site-t&oacute;l.</P>

<CENTER><TABLE CELLSPACING=0 CELLPADDING=0 >
<TR>
<TD><IMG SRC="szerk2a.gif" HEIGHT=270 WIDTH=210></TD>

<TD><IMG SRC="szerk2b.gif" HEIGHT=270 WIDTH=280></TD>
</TR>

<TR>
<TD ALIGN=CENTER><B><FONT SIZE=-1>2.a &aacute;bra</FONT></B></TD>

<TD ALIGN=CENTER><B><FONT SIZE=-1>2.b &aacute;bra</FONT></B></TD>
</TR>
</TABLE></CENTER>

<P><B>K&eacute;pek - k&uuml;l&ouml;n vagy beillesztve?</B> P&eacute;ld&aacute;nkban
a kezd&otilde;lap tartalmaz egy p&aacute;r szavas bemutatkoz&aacute;st
(en.txt), &eacute;s ebben a megfelel&otilde; helyre beillesztve az iskola
f&eacute;nyk&eacute;p&eacute;t.(2.a &aacute;bra.) Megcsin&aacute;lhattuk
volna azt is, hogy az iskola k&eacute;p&eacute;t nem illesztj&uuml;k be
a kezd&otilde;lapba, hanem p&eacute;ld&aacute;ul a sz&ouml;vegben az iskola
nev&eacute;t linkk&eacute;nt haszn&aacute;ljuk, amely a k&eacute;pfile-ra
mutat.(2.b &aacute;bra.) A k&eacute;tf&eacute;le megold&aacute;st az al&aacute;bbi
t&aacute;bl&aacute;zat hasonl&iacute;tja &ouml;ssze:</P>

<CENTER><TABLE BORDER=1 >
<TR ALIGN=LEFT VALIGN=TOP>
<TD></TD>

<TD><I>A k&eacute;p be van illesztve az oldalba</I></TD>

<TD NOWRAP><I>A k&eacute;p k&uuml;l&ouml;n&aacute;ll&oacute;, az oldalhoz
kapcsolva</I></TD>
</TR>

<TR>
<TD ALIGN=LEFT VALIGN=TOP><I>El&otilde;nye</I></TD>

<TD ALIGN=LEFT VALIGN=TOP NOWRAP>A k&eacute;p r&ouml;gt&ouml;n l&aacute;that&oacute;,
nem kell ut&aacute;naj&aacute;rni</TD>

<TD>Takar&eacute;kos megold&aacute;s a let&ouml;lt&eacute;si id&otilde;
&eacute;s a k&eacute;perny&otilde;ter&uuml;let szempontj&aacute;b&oacute;l.</TD>
</TR>

<TR ALIGN=LEFT VALIGN=TOP>
<TD><I>H&aacute;tr&aacute;nya</I></TD>

<TD>A let&ouml;lt&eacute;s id&otilde;t vehet ig&eacute;nybe; aki a k&eacute;pre
nem k&iacute;v&aacute;ncsi, az f&ouml;l&ouml;sleges v&aacute;rakoz&aacute;sra
k&eacute;nyszer&uuml;l. A k&eacute;perny&otilde;b&otilde;l &eacute;rt&eacute;kes
helyet foglalhat el a tov&aacute;bbi sz&ouml;veges inform&aacute;ci&oacute;t&oacute;l;
akit ink&aacute;bb az &eacute;rdekel, annak g&ouml;rgetnie kell a k&eacute;perny&otilde;t.</TD>

<TD>Ha a k&eacute;p szoros kapcsolatban van a sz&ouml;veggel, p&eacute;ld&aacute;ul
az &eacute;rtelmez&eacute;s&eacute;hez fontos, akkor k&eacute;nyelmetlen
oda-vissza lapozgatni a k&eacute;p &eacute;s a sz&ouml;veg k&ouml;z&ouml;tt.</TD>
</TR>
</TABLE></CENTER>

<P>&Aacute;ltal&aacute;ban v&eacute;ve teh&aacute;t az a l&eacute;nyeg,
hogy ha a sz&ouml;veg a k&eacute;p n&eacute;lk&uuml;l l&eacute;nyegesen
kevesebbet &eacute;r, illetve a k&eacute;p a sz&ouml;veget illusztr&aacute;lja,
akkor c&eacute;lszer&ucirc; beilleszteni a k&eacute;pet, ha csak kieg&eacute;sz&iacute;t&otilde;
inform&aacute;ci&oacute;, akkor ink&aacute;bb k&uuml;l&ouml;n linkk&eacute;nt
&eacute;rdemes elhelyezni. Ez persze nemcsak k&eacute;pekre, hanem m&aacute;s
digitaliz&aacute;lt, helyig&eacute;nyes anyagokra is vonatkozik.</P>

<CENTER><TABLE CELLSPACING=0 CELLPADDING=0 >
<TR>
<TD ALIGN=CENTER VALIGN=BOTTOM><IMG SRC="szerk3a.gif" HEIGHT=170 WIDTH=130></TD>

<TD ALIGN=CENTER VALIGN=BOTTOM><IMG SRC="szerk3b.gif" HEIGHT=170 WIDTH=130></TD>

<TD ALIGN=CENTER VALIGN=BOTTOM><IMG SRC="szerk3c.gif" HEIGHT=170 WIDTH=130></TD>
</TR>

<TR>
<TD ALIGN=CENTER VALIGN=TOP>
<CENTER><P><B><FONT SIZE=-1>3.a &aacute;bra</FONT></B></P></CENTER>
</TD>

<TD ALIGN=CENTER VALIGN=TOP>
<CENTER><P><B><FONT SIZE=-1>3.b &aacute;bra</FONT></B></P></CENTER>
</TD>

<TD ALIGN=CENTER VALIGN=TOP>
<CENTER><P><B><FONT SIZE=-1>3.c &aacute;bra</FONT></B></P></CENTER>
</TD>
</TR>
</TABLE></CENTER>

<P><B>A site logikai fel&eacute;p&iacute;t&eacute;se.</B> Maradjunk a p&eacute;ld&aacute;nkn&aacute;l
(1. &aacute;bra)! A csal&aacute;d oldal&aacute;n a sz&ouml;vegen k&iacute;v&uuml;l
helyet kaphat a cica fot&oacute;ja (hasonl&oacute;k&eacute;ppen, mint a
kezd&otilde;lapon az iskol&aacute;&eacute;), &eacute;s egy link a lak&aacute;ssal
kapcsolatos inform&aacute;ci&oacute;kra (3.a &aacute;bra). A lak&aacute;s
oldal&aacute;nak szint&eacute;n nem k&ouml;telez&otilde; itt lennie. Rakhattuk
volna egy k&uuml;l&ouml;n oldalra, amely a kezd&otilde;lapr&oacute;l ny&iacute;lik
(3.b &aacute;bra). Vagy az is &eacute;ppen ilyen j&oacute; megold&aacute;s,
ha itt hagyjuk, de a kezd&otilde;lapr&oacute;l is tesz&uuml;nk egy linket
a lak&aacute;s oldal&aacute;ra, ha a sz&ouml;vegben sz&oacute; esik a lak&aacute;sr&oacute;l
(3.c &aacute;bra). Ugyanarra az oldalra t&ouml;bb helyen is hivatkozhatsz,
ha a sz&ouml;veg is mind a k&eacute;t helyen felh&iacute;vja a figyelmet
arra a dologra, ahov&aacute; a link mutat. De ezt a megold&aacute;st csak
ritka esetekben &eacute;rdemes alkalmazni, mert ha k&uuml;l&ouml;nben az
olvas&oacute; elbizonytalanodhat. Lehet, hogy nem fogja tudni, hogy most
milyen m&eacute;lyre ker&uuml;lt a site-ba, vagyis sokkal k&ouml;nnyebben
elt&eacute;ved.</P>

<TABLE CELLSPACING=0 CELLPADDING=0 >
<TR>
<TD ALIGN=LEFT VALIGN=TOP>&Aacute;ltal&aacute;ban az oldalak kapcsolat&aacute;ra
a 4. &aacute;br&aacute;n l&aacute;that&oacute; <I>hierarchikus fel&eacute;p&iacute;t&eacute;s</I>
a jellemz&otilde;. Tipikus p&eacute;lda erre a weben a <A HREF="http://www.hungary.com/hudir/">HuDir</A>,
amelyben nagy mennyis&eacute;g&ucirc; inform&aacute;ci&oacute;b&oacute;l
v&aacute;logathatunk &uacute;gy, hogy mindig &uacute;jra &eacute;s &uacute;jra
sz&ucirc;k&iacute;tj&uuml;k a keresett inform&aacute;ci&oacute;k k&ouml;r&eacute;t.

<P>A&nbsp;hierarchikus fel&eacute;p&iacute;t&eacute;s adja az alapot, de
n&eacute;ha egym&aacute;st&oacute;l t&aacute;vol es&otilde; oldalakat is
&ouml;sszekapcsolhatunk, ha logikailag &ouml;sszetartoznak. P&eacute;ld&aacute;ul:
</P>

<UL>
<LI>Ha egy kir&aacute;ndul&aacute;sr&oacute;l mes&eacute;lsz, ahol veled
voltak a bar&aacute;taid is, akkor a nev&uuml;kb&otilde;l olyan linket
csin&aacute;lhatsz, amely a r&oacute;luk sz&oacute;l&oacute; oldalra mutat.</LI>

<LI>Ha valamelyik &quot;sokadik oldalon&quot; (a hierarchia alj&aacute;n)
valami komoly v&aacute;ltoz&aacute;s t&ouml;rt&eacute;nt, felker&uuml;lt
egy &uacute;j, &eacute;rdekes, vagy nagyon id&otilde;szer&ucirc; anyag,
felh&iacute;vhatod r&aacute; a figyelmet a kezd&otilde;lapon! Tegy&eacute;l
r&aacute; egy k&ouml;zvetlen linket, hogy k&ouml;nnyebben el&eacute;rhet&otilde;
legyen. &Iacute;gy annak, aki m&aacute;r j&aacute;rt a site-odon, nem kell
v&eacute;gigmennie sok olyan oldalon, amelyet m&aacute;r l&aacute;tott.
(Ilyenkor a hivatkoz&aacute;s mell&eacute; le kell &iacute;rni azt is,
hogy am&uacute;gy ez az &uacute;j anyag melyik oldal(ak)on kereszt&uuml;l
&eacute;rhet&otilde; el.)</LI>
</UL>
</TD>

<TD ALIGN=CENTER VALIGN=TOP>
<CENTER><P><IMG SRC="szerk4.gif" HEIGHT=150 WIDTH=130 ALIGN=TEXTTOP><BR>
<B><FONT SIZE=-1>4. &aacute;bra</FONT></B></P></CENTER>
</TD>
</TR>
</TABLE>

<P><B>Logikailag sz&uuml;ks&eacute;ges m&oacute;dos&iacute;t&aacute;sok.</B>
Mivel a bar&aacute;tainkr&oacute;l csak egy peti.txt file &aacute;llt rendelkez&eacute;s&uuml;nkre
(1. &aacute;bra), nem lenne &eacute;rtelme k&uuml;l&ouml;n egy olyan oldalt
csin&aacute;lni, amelyen a bar&aacute;tok k&ouml;z&uuml;l v&aacute;laszthatunk.
K&eacute;s&otilde;bb, ha tov&aacute;bbi bar&aacute;tok anyag&aacute;val
b&otilde;v&uuml;l a site, meg kell majd csin&aacute;lni ezt is. A hobbi-oldaln&aacute;l
viszont a zene &eacute;s a film miatt m&aacute;r most sz&uuml;ks&eacute;g
lehet egy &uacute;j oldal meg&iacute;r&aacute;s&aacute;ra, amely a v&aacute;laszt&aacute;st,
a navig&aacute;l&aacute;st fogja seg&iacute;teni. Az ilyen oldalak azonban
helyettes&iacute;thet&otilde;k m&aacute;s, grafikus navig&aacute;ci&oacute;s
eszk&ouml;z&ouml;kkel, amelyekr&otilde;l r&eacute;szletesen a <I>Grafikai
tervez&eacute;s</I> c&iacute;m&ucirc; fejezetben lesz sz&oacute;. Ha egyel&otilde;re
sz&ouml;veges eszk&ouml;z&ouml;kkel szeretn&eacute;l dolgozni, k&eacute;t
lehet&otilde;s&eacute;ged van.</P>

<OL>
<LI>L&eacute;trehozol egy hobbir&oacute;l sz&oacute;l&oacute; oldalt, amelyen
csak k&eacute;t link van, az egyik a filmes, a m&aacute;sik a zen&eacute;s
oldalra mutat. Ez a szerencs&eacute;sebb, mert k&eacute;s&otilde;bb, ha
a tov&aacute;bbi hobbikr&oacute;l esik sz&oacute;, beteszed az &uacute;j
file-okat a mostaniak mell&eacute;, &eacute;s csak az eligaz&iacute;t&oacute;
oldalt kell kib&otilde;v&iacute;tened &uacute;jabb linkekkel.</LI>

<LI>Egy oldalba rakod bele mindk&eacute;t hobbid anyag&aacute;t. Ekkor
csak egy file-od van, viszont ez egy id&otilde; ut&aacute;n nagyon hossz&uacute;ra
ny&uacute;lhat, &eacute;s mindig ebbe kell majd beleillesztened az &uacute;j
anyagot. K&eacute;nyelmetlen olvasni is &eacute;s szerkeszteni is. Ez a
megold&aacute;s csak akkor hasznos, ha k&uuml;l&ouml;nben nagyon sok (mondjuk
10-n&eacute;l t&ouml;bb) file keletkezne, &eacute;s mind nagyon r&ouml;videk
lenn&eacute;nek.&nbsp;Teh&aacute;t ha sok dologr&oacute;l &iacute;rsz r&ouml;viden,
akkor praktikusabb ezeket egy file-ba tenni. (P&eacute;ld&aacute;ul, ha
minden filmr&otilde;l, amit megn&eacute;zel, &iacute;rsz k&eacute;t sort,
akkor ezeknek nem kell k&uuml;l&ouml;n oldal.)</LI>
</OL>

<P><B>Rendezett file-t&aacute;rol&aacute;s.</B> A most kialak&iacute;tott
szerkezetet igyekezz &eacute;szben tartani. Ez megk&ouml;nny&iacute;ti
a site k&eacute;s&otilde;bbi b&otilde;v&iacute;t&eacute;s&eacute;t, karbantart&aacute;s&aacute;t
is, de m&aacute;r a site l&eacute;trehoz&aacute;s&aacute;n&aacute;l is
seg&iacute;teni fog neked. A t&eacute;mak&ouml;reid, illetve a fenti szerkezeti
rajz alapj&aacute;n hozd l&eacute;tre a k&ouml;nyvt&aacute;rszerkezetet,
&eacute;s a file-okat ezekbe csoportos&iacute;tsd. &Iacute;gy minden anyagnak
meglesz a maga helye. Ha k&eacute;s&otilde;bb b&otilde;v&iacute;ted vagy
v&aacute;ltoztatod a site-ot, k&ouml;nnyebb lesz megtal&aacute;lni, hogy
melyik file-t kell m&oacute;dos&iacute;tanod. Most, a kezdeti szerkeszt&eacute;skor
m&eacute;g nem tudhatod, mekkor&aacute;ra fog b&otilde;v&uuml;lni a site,
&eacute;s mennyire lehetne zavar&oacute;, ha minden anyag &ouml;mlesztve
egyetlen k&ouml;nyvt&aacute;rba ker&uuml;lne. K&eacute;s&otilde;bb v&aacute;ltoztatni
a k&ouml;nyvt&aacute;rszerkezeten nagyon neh&eacute;zkes, a linkeket is
&uacute;jra v&eacute;gig kell n&eacute;zned (ha a web-szerkeszt&otilde;
programod meg nem teszi helyetted), &uacute;gyhogy sokkal egyszer&ucirc;bb
m&aacute;r az elej&eacute;n egy j&oacute; k&ouml;nyvt&aacute;rrendszert
kital&aacute;lni.</P>

<P><B>Feladatok</B></P>

<OL>
<LI>K&eacute;sz&iacute;ts egy &aacute;br&aacute;t kedvenc site-od szerkezet&eacute;r&otilde;l!
(Ha sok oldalb&oacute;l &aacute;ll, akkor csak a kezd&otilde;lapr&oacute;l
egy vagy k&eacute;t l&eacute;p&eacute;ssel el&eacute;rhet&otilde; oldalakat
t&eacute;rk&eacute;pezd fel.)</LI>

<LI>Az 1. &aacute;br&aacute;hoz hasonl&oacute;an tervezd meg, hogy a list&aacute;don
szerepl&otilde; anyagok k&ouml;z&uuml;l melyek ker&uuml;lnek egy oldalra,
illetve hov&aacute; teszel linkeket. D&ouml;ntsd el, hogy hogyan helyezed
el a k&eacute;peket. &Iacute;rd fel a list&aacute;ra a logikailag sz&uuml;ks&eacute;ges
&uacute;j oldalakat is, &eacute;s &iacute;rd meg &otilde;ket!</LI>

<LI>List&aacute;zd ki a g&eacute;pen site-od anyagainak fa-szerkezet&ucirc;
rajz&aacute;t, a k&eacute;perny&otilde;re vagy pap&iacute;rra. Hasonl&iacute;tsd
&ouml;ssze az &iacute;gy kapott list&aacute;t a pap&iacute;ron meglev&otilde;
terveddel!</LI>
</OL>

<P>
<HR WIDTH="100%"><BR>
<A HREF="TERVEZ.HTM">Vissza az el&otilde;z&otilde; lapra</A></P>

</BODY>
</HTML>
