<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
   <TITLE>Technikai el&otilde;k&eacute;sz&uuml;letek</TITLE>
   <META NAME="Author" CONTENT="">
   <META NAME="GENERATOR" CONTENT="Mozilla/3.04Gold (Win95; I) [Netscape]">
</HEAD>
<BODY TEXT="#000000" BGCOLOR="#FFFFE8" LINK="#0000EE" VLINK="#551A8B" ALINK="#FF0000">

<H2 ALIGN=CENTER>Oldalaink megtervez&eacute;se, el&otilde;k&eacute;sz&iacute;t&eacute;se</H2>

<H3><I>Technikai el&otilde;k&eacute;sz&uuml;letek</I></H3>

<P><B>Illusztr&aacute;ci&oacute;.</B> Most teh&aacute;t van egy k&eacute;pzeletbeli
kis dosszi&eacute;d, amely a site lehets&eacute;ges anyagait tartalmazza.
Most n&eacute;zd v&eacute;gig az anyagokat Internetes szemmel is. Ha a
felsoroltak k&ouml;z&uuml;l b&aacute;rkihez vagy b&aacute;rmihez tudsz
tal&aacute;lni az Interneten illusztr&aacute;ci&oacute;k&eacute;nt k&eacute;pet
vagy plusz inform&aacute;ci&oacute;t, azt t&ouml;ltsd le. Otthon is kereshetsz
az anyagaidhoz f&eacute;nyk&eacute;peket, p&eacute;ld&aacute;ul magadr&oacute;l,
csal&aacute;dodr&oacute;l, a szob&aacute;dr&oacute;l, a lak&aacute;sotokr&oacute;l
(h&aacute;zatokr&oacute;l), az iskol&aacute;dr&oacute;l, stb.</P>

<P><B>Digitaliz&aacute;l&aacute;s.</B> Az olyan k&eacute;peket, amelyek
csak pap&iacute;ron vannak meg, pr&oacute;b&aacute;ld meg digitaliz&aacute;lni,
vagy k&eacute;rj meg erre valakit. (A k&eacute;pek form&aacute;tum&aacute;val,
m&eacute;ret&eacute;vel &eacute;s egy&eacute;b jellemz&otilde;ivel kapcsolatban
el&otilde;bb olvasd el a <I>Grafikai tervez&eacute;s</I> c&iacute;m&ucirc;
fejezet erre vonatkoz&oacute; r&eacute;sz&eacute;t.) A&nbsp;k&eacute;p
digitaliz&aacute;l&aacute;s&aacute;hoz lapolvas&oacute; (scanner) sz&uuml;ks&eacute;ges,
a hozz&aacute; val&oacute; szoftverrel egy&uuml;tt. Ne feledd, hogy nemcsak
sz&ouml;veg &eacute;s k&eacute;p j&ouml;het sz&oacute;ba, hanem elvileg
lehet&otilde;s&eacute;ged van mozg&oacute;k&eacute;p, hanganyag &eacute;s
b&aacute;rmilyen egy&eacute;b file elhelyez&eacute;s&eacute;re is. (Gyakorlatilag
probl&eacute;m&aacute;d akadhat az ilyen anyagok digitaliz&aacute;l&aacute;s&aacute;val:
a mozg&oacute;k&eacute;phez viszonylag komoly felszerel&eacute;s kell,
hangdigitaliz&aacute;l&aacute;shoz el&eacute;g egy hangk&aacute;rtya mikrofonnal
&eacute;s a megfelel&otilde; szoftverrel.) Mivel szerz&otilde;i jogv&eacute;delem
al&aacute; es&otilde; anyagot (p&eacute;ld&aacute;ul &uacute;js&aacute;gban
megjelent k&eacute;peket) nem helyezhetsz el a site-odon, ilyen anyagnak
m&aacute;r a digitaliz&aacute;l&aacute;s&aacute;val sem &eacute;rdemes
bajl&oacute;dnod.</P>

<P><B>Sz&ouml;veg.</B> A k&eacute;peken k&iacute;v&uuml;l a sz&ouml;veges
inform&aacute;ci&oacute;t is meg kell &iacute;rnod, illetve &ouml;ssze
kell szedned. K&eacute;sz&iacute;ts valamilyen sz&ouml;vegszerkeszt&otilde;ben
sz&ouml;vegfile-okat, amelyekben le&iacute;rod az el&otilde;z&otilde; pontb&oacute;l
mindazt, amihez kedved van. Most m&eacute;g ne haszn&aacute;lj sz&ouml;vegform&aacute;z&aacute;st,
csak a sz&ouml;veg tartalm&aacute;ra koncentr&aacute;lj. C&eacute;lszer&ucirc;
egy file-ba annyit &iacute;rnod, amennyit egy web-oldalra el akarsz majd
helyezni, teh&aacute;t &iacute;r&aacute;s k&ouml;zben m&aacute;r egy kicsit
csoportos&iacute;tanod is kell az egyes anyagokat. Ha a sz&ouml;vegszerkeszt&otilde;d
tud HTML&nbsp;form&aacute;ban menteni, akkor a k&eacute;s&otilde;bbi munka
megk&ouml;nny&iacute;t&eacute;se &eacute;rdek&eacute;ben c&eacute;lszer&ucirc;
&iacute;gy elmentened a file-okat. (S&otilde;t, ha ismered valamilyen weboldal-szerkeszt&otilde;
program haszn&aacute;lat&aacute;t, akkor m&aacute;r sz&ouml;vegszerkeszt&otilde;
gyan&aacute;nt is azt haszn&aacute;lhatod.) Ha nem, akkor haszn&aacute;lj
valamilyen egyszer&ucirc; &eacute;s elterjedt form&aacute;tumot, amelyben
az &eacute;kezetes bet&ucirc;knek sem esik b&aacute;nt&oacute;d&aacute;suk.
(Pl. sima sz&ouml;veg, vagy esetleg RTF.)</P>

<P><B>Feladatok</B></P>

<OL>
<LI>A list&aacute;dhoz mindegyik t&eacute;ma mell&eacute; &iacute;rd le,
hogy milyen file-okat tudsz hozz&aacute; szerezni vagy k&eacute;sz&iacute;teni!
(Sz&ouml;veg, k&eacute;p, hanganyag, stb.) Egy harmadik oszlopba pedig
azt &iacute;rd, hogy hogyan lesz meg a file.&nbsp;(Pl.:&nbsp;Be kell g&eacute;pelni,
&uacute;jat kell &iacute;rni, digitaliz&aacute;lni kell a k&eacute;pet,
le kell f&eacute;nyk&eacute;pezni, stb.) Ezzel munkatervet k&eacute;sz&iacute;tett&eacute;l.</LI>

<LI>Hajtsd v&eacute;gre a tervedet! K&eacute;sz&iacute;ts a munk&aacute;id
k&ouml;z&ouml;tt k&uuml;l&ouml;n k&ouml;nyvt&aacute;rat a list&aacute;don
szerepl&otilde; minden k&uuml;l&ouml;n t&eacute;mak&ouml;rnek!&nbsp;El&otilde;sz&ouml;r
k&eacute;sz&iacute;tsd el a legfontosabb sz&ouml;veges anyagokat, azt&aacute;n
j&ouml;hetnek a k&eacute;pek &eacute;s a kev&eacute;sb&eacute; fontos sz&ouml;vegek.
A&nbsp;file-okat helyezd el a megfelel&otilde; k&ouml;nyvt&aacute;rakban.</LI>
</OL>

<P>
<HR WIDTH="100%"><BR>
<A HREF="TERVEZ.HTM">Vissza az el&otilde;z&otilde; lapra</A></P>

</BODY>
</HTML>
